public class Application {
    /**
     * 在这个地方请自己设计自己的程序
     *
     * HttpUtils类中为OkHttp的get与post方法的封装，用的是同步，如果是安卓端，请改为异步，或在子线程中调用
     * BiliApis类调用了HttpUtils中的方法，实现了B站的各种操作，请自行决定如何使用这些操作
     * OtherUtils类中为一些工具类方法
     *
     * 你需要处理的问题：
     * 1.统计并保存人之初的信息
     * 2.通过你可以想到的任何方法取到你账号的cookies，并保存下来
     * 3.调用BiliApis内的方法，实现对动态评论区的遍历
     * 4.找出你记录的人之初的评论，调用BiliApis中的方法进行点赞和扣1
     * 5.控制程序的开始、结束和暂停
     *
     * 一些建议：
     * 1.你需要注意，如何防止重复点赞和扣1
     * 2.遍历的时候需要每次都全部遍历吗？
     * 3.记得输出日志
     * **/
}
